import style from "./WhoWeAre.module.css";
import aboutUs from "../../assets/imgs/About us page-bro.svg";
function WhoWeAre() {
  const aboutUsData = [
    {
      title: "من نحن",
      data: [
        'تأسست "ستوك سكويرز" عام ٢٠١٨ كمبادرة رائدة على وسائل التواصل الاجتماعي لنشر الثقافة الاستثمارية في أسواق المال بقيادة مستشار الاستثمار أ.طارق الليثي.',
        'تطورت رؤيتنا إلى واقع أكثر قوة واحترافية، حيث أُسست شركة "فيفتي فايف إنفيست" في عام ٢٠٢٢، المالكة للعلامة التجارية "ستوك سكويرز"، كشركة استشارات مالية وتدريب مُرخصة رسميًا من وزارة الاستثمار المصرية.',
        "نهدف إلى تحقيق نقلة نوعية في نشر الوعي المالي، وتقديم خدمات استشارية متخصصة، وتدريب عملي يواكب احتياجات الأسواق، مما يعزز من قدرة الأفراد والشركات على اتخاذ قرارات استثمارية مستنيرة.",
      ],
    },
    {
      title: "رؤيتنا",
      data: [
        "نسعى إلى أن نصبح المصدر الأول لنشر الثقافة الاستثمارية وتعزيز المفاهيم المالية في الوطن العربي.",
        "ترتكز رؤيتنا على تمكين المستثمرين ورواد الأعمال بالمعرفة والأدوات التي تتيح لهم النجاح في تحقيق تطلعاتهم، والإسهام في بناء اقتصاد مستدام يواكب التغيرات العالمية.",
      ],
    },
    {
      title: "رسالتنا",
      data: [
        "تقديم الدعم المعرفي للمستثمرين ورواد الأعمال من خلال خدمات استشارية وتدريبية مبتكرة وموثوقة.",
        "نطمح لأن نكون الشريك المثالي لتحقيق النجاح، مع التركيز على إثراء المعرفة الاستثمارية والمساهمة في بناء مجتمع أكثر وعيًا وثقافة في مجال المال والاستثمار.",
      ],
    },
   
  ];

  const rules=[
    {
      name:" الالتزام والجودة",
      data:"نحرص على تقديم خدمات عالية الجودة تلتزم بأعلى المعايير المهنية."
    },
    {
      name:"التعليم والتمكين",
      data:"نؤمن بأهمية نشر المعرفة وتمكين الأفراد من اتخاذ قرارات مستنيرة في عالم الاستثمار."
    },
    {
      name:"الابتكار والتطور",
      data:"نسعى باستمرار لتطوير خدماتنا وتقديم حلول مبتكرة تتماشى مع متغيرات السوق واحتياجات العملاء."
    },
    {
    name:"الشفافية والمصداقية",
    data:"نضع الأمانة والوضوح في صدارة تعاملاتنا لضمان بناء ثقة مستدامة مع عملائنا وشركائنا."
  },
  
 
 
  {
    name:" الاستدامة والمسؤولية",
    data:"نسعى لدعم الاقتصاد المحلي والإقليمي من خلال تشجيع ممارسات استثمارية مستدامة ومسؤولة"
  }


]
  return (
    <div>
      <div className="p-3 mt-5">
        <div className="flex flex-col-reverse justify-between md:flex-row">
          <div className="w-[100%] md:w-[60%]">
            <div className="gap-3">
              <h1 className="text-3xl font-bold mb-3">ستوك سكويرز :</h1>
            </div>

            <div className="mb-10 mt-5">
              {aboutUsData.map((aboutUsdata, idx) => (
                <div key={idx} className="mb-5">
                  <div className="flex gap-4 items-center">
                    <h1
                      className={`text-2xl font-bold mb-4 mt-3 bg-yellow-200  rounded-l-3xl p-2 ${style.title}`}
                    >
                      {aboutUsdata.title}
                    </h1>
                  </div>
                  <p className="leading-7">{aboutUsdata.data}</p>
                </div>
              ))}

              {rules.map((rule,idx)=>(
                <div key={idx} className="flex flex-col md:flex-row gap-2">
                <h3 className="text-red-600 text-lg font-semibold">{rule.name}:</h3>
                <p>{rule.data}</p>
                </div>

              ))}
            </div>
          </div>

          <div className="h-[50%] w-[100%] md:h-[40%] md:mt-20 md:w-[40%]">
            <img src={aboutUs} />
          </div>
        </div>
      </div>
    </div>
  );
}
export default WhoWeAre;
