export const blogCardDetails = [
  {
    category:"أسواق المال",
    title: "كيف تستثمر اموالك في أوقات الحرب",
    description1: `في ظل التوترات العالمية المتزايدة والتهديدات المحتملة لاندلاع حرب عالمية ثالثة،
  والتي يرى خبرائنا أنها بدأت بالفعل ولكنها لم تصل إلى مرحلة الانفجار حتى الآن.
  ويُعتبر استثمار الأموال في الأوقات الحرجة من أهم الاستراتيجيات التي تحقق لبعض المستثمرين المحترفين
  الكثير من الأرباح الضخمة..`,
    // imgURL: "investImg.jpg",
    description2: `وفيما يلي سنوضح لكم أهم الأدوات المالية التي تتأثر بالحروب حتى تساعدكم في
تحقيق الأرباح في صفقاتكم الاستثمارية في الفترة القادم
  1. النفط: يعتبر النفط من أهم السلع التي تتأثر بشكل كبير في فترات الحروب،
  حيث يزيد الطلب على النفط خلال الحروب نتيجة لاستخدامه في العديد من الصناعات والعمليات العسكرية.
  2. المعادن الثمينة: مثل الذهب والفضة، حيث يلجأ المستثمرون إلى الذهب كوسيلة للتحوط ضد التقلبات الاقتصادية والسياسية خلال الحروب.
  3. الأسلحة والصناعات الحربية: يزيد الطلب على الأسلحة والتجهيزات العسكرية خلال الحروب، مما يؤدي إلى زيادة قيمة هذه الصناعات وأسهم الشركات المتعلقة بها.
  4. السلع الزراعية: تتأثر بعض السلع الزراعية بسبب اضطرابات في الإمدادات والتجارة العالمية خلال الحروب.
  5. النقد الأجنبي: يمكن أن تتأثر قيمة العملات الأجنبية بسبب التقلبات في الأسواق المالية خلال فترات الحروب.
  
  هذه بعض السلع الرئيسية التي تتأثر خلال الحروب، والتي يجب على المستثمرين مراقبتها عند اتخاذ صفقات استثمارية خلال تلك الفترات الصعبة.
  في النهاية، يجب أن يكون المستثمر على استعداد للتعامل مع التقلبات الكبيرة في الأسواق المالية خلال فترات الحروب المحتملة،
  وأن يحتفظ بروح هادئة وثقة في قدرته على اتخاذ القرارات الصحيحة في الوقت المناسب.`,
  },
];
