export const questions = [
    {
      question: "ما هي خبرتك في التسويق لمنتجات أو خدمات مشابهة؟",
      option1: "أ. أعمل في التسويق لأكثر من ٥ سنوات.",
      option2: "ب. لدي خبرة متوسطة في التسويق لحوالي سنتين.",
      option3: "ج. كنت أعمل كمتدرب في شركة تسويق لمدة عام.",
      option4: "د. أعمل في مجال آخر لكن لدي اهتمام بالتسويق."
    },
    {
      question: "هل لديك خبرة سابقة في مجال البورصة أو أسواق المال؟",
      option1: "أ. نعم، أقدم الاستشارات في هذا المجال لأكثر من 3 سنوات.",
      option2: "ب. لدي خبرة في تقديم التدريب والتوجيهة للمستثمرين المبتدئين.",
      option3: "ج. كنت أعمل في شركة استشارات مالية أو شركة وساطة مالية.",
      option4: "د. أعمل في مجال آخر لكن لدي اهتمام."
    },
    {
      question: "كيف تقوم بجذب العملاء واهتمامهم بالمنتجات أو الخدمات التي تسوق لها؟",
      option1: "أ. عبر التوصيات والعلاقات الشخصية أو الشهادات من العملاء الحاليين.",
      option2: "ب. من خلال الإعلانات الرقمية ووسائل التواصل الاجتماعي.",
      option3: "ج. باستخدام التسويق عبر البريد الإلكتروني.",
      option4: "د. بتنظيم ورش عمل وندوات تعريفية."
    },
    {
      question: "هل لديك قاعدة بيانات للعملاء المحتملين أو المستثمرين؟ وما حجمها؟",
      option1: "أ. نعم، لدي قاعدة بيانات كبيرة تحتوي على أكثر من ١٠٠٠ عميل محتمل.",
      option2: "ب. لدي قاعدة بيانات متوسطة لا تقل عن ٥٠٠ عميل محتمل.",
      option3: "ج. لدي قائمة اتصالات يمكن تحويلها إلى قاعدة بيانات.",
      option4: "د. لا، ليس لدي قاعدة بيانات حالياً."
    },
    {
      question: "ما هي الاستراتيجيات التي استخدمتها سابقًا لتحقيق أهداف المبيعات؟",
      option1: "أ. التسويق عبر وسائل التواصل الاجتماعي والإعلانات الرقمية.",
      option2: "ب. تقديم العروض الترويجية والخصومات للعملاء.",
      option3: "ج. التسويق بالمحتوى والمقالات التوجيهية.",
      option4: "د. استخدام التسويق بالعمولة وبرامج الشراكة."
    },
    {
      question: "كيف تقيم نجاح حملاتك التسويقية؟ وما هي المعايير التي تستخدمها؟",
      option1: "أ. قياس عدد المبيعات والإيرادات المحققة.",
      option2: "ب. تحليل نسبة التحويل وعدد العملاء الجدد.",
      option3: "ج. متابعة التفاعل والمشاركات على وسائل التواصل الاجتماعي.",
      option4: "د. مقارنة النتائج بالميزانية المستخدمة وأهداف الحملة."
    },
    {
      question: "هل لديك أمثلة على حملات تسويقية ناجحة قمت بها في الماضي؟",
      option1: "أ. نعم، قمت بحملة تسويقية ناجحة لجذب ١٠٠٠ عميل جديد.",
      option2: "ب. لدي حملة تزيد من المبيعات بنسبة ٥٠٪.",
      option3: "ج. قمت بتنظيم ورشة عمل جذبت ٢٠٠ مشارك.",
      option4: "د. لا، ليس لدي أمثلة على حملات سابقة."
    },
    {
      question: "كيف تقوم ببناء والحفاظ على علاقات طويلة الأمد مع العملاء؟",
      option1: "أ. بتقديم دعم عملاء ممتاز وسريع الاستجابة.",
      option2: "ب. بتنظيم فعاليات وندوات تعريفية بانتظام.",
      option3: "ج. بالمتابعة المستمرة والتواصل الشخصي.",
      option4: "د. بتقديم استشارات مجانية ونصائح مهنية."
    },
    {
      question: "ما هي خبرتك في التعامل مع منصات التداول المختلفة وأدوات التحليل الفني؟",
      option1: "أ. خبرة واسعة في استخدام منصات التداول الشهيرة (انفيستنج، تريدينج فيو).",
      option2: "ب. القدرة على تطوير استراتيجيات تداول مخصصة.",
      option3: "ج. فهم عميق للمؤشرات الفنية وأنماط الرسم البياني.",
      option4: "د. ليس لدي خبرة في استخدام منصات التداول المختلفة."
    },
    {
      question: "ما هي أهدافك طويلة الأجل من انضمامك الى التسويق بالعمولة معنا؟",
      option1: "أ. زيادة الوعي بالعلامة التجارية وزيادة عدد العملاء الجدد.",
      option2: "ب. تحسين معدل تحويل العملاء المحتملين إلى عملاء فعليين.",
      option3: "ج. زيادة متوسط قيمة الطلب لكل عميل.",
      option4: "د. تحقيق أرباح سريعة وسهلة من خلال التسويق."
    }
  ];
  