export const questions = [
    {
      question: "ما هي خبرتك العملية في مجال البورصة وأسواق المال؟",
      option1: "أ. أقل من 3 سنوات",
      option2: "ب. من 3 إلى 5 سنوات",
      option3: "ج. من 5 إلى 10 سنوات",
      option4: "د. أكثر من 10 سنوات"
    },
    {
      question: "هل لديك أي شهادات مهنية أو تعليمية في هذا المجال؟ يرجى ذكر الشهادات التي حصلت عليها.",
      option1: "أ. لا شهادات",
      option2: "ب. شهادة واحدة",
      option3: "ج. شهادتين",
      option4: "د. أكثر من شهادتين"
    },
    {
      question: "هل سبق لك أن قدمت تدريبات أو دورات تعليمية في مجال البورصة وأسواق المال؟ إذا كان الجواب نعم، ما هي المواضيع التي غطيتها؟",
      option1: "أ. لم أقدم تدريبات",
      option2: "ب. قدمت تدريبات أساسية",
      option3: "ج. قدمت تدريبات متقدمة",
      option4: "د. قدمت تدريبات شاملة"
    },
    {
      question: "ما هي البورصات التي عملت عليها بطريقة عملية؟",
      option1: "أ. البورصة المصرية",
      option2: "ب. البورصة السعودية",
      option3: "ج. البورصة الأمريكية",
      option4: "د. البورصة العالمية والفوركس",
      option5: "هـ. بورصة العملات المشفرة"
    },
    {
      question: "كيف تقوم بتحليل السوق وتقييم أداء الأسهم؟",
      option1: "أ. تحليل فني فقط",
      option2: "ب. تحليل أساسي فقط",
      option3: "ج. تحليل فني وأساسي",
      option4: "د. تحليل فني وأساسي معاً واستراتيجيات مدمجة"
    },
    {
      question: "هل لديك خبرة في استخدام أدوات التداول والتحليل الفني؟ إذا كان الجواب نعم، يرجى توضيح الأدوات التي تستخدمها.",
      option1: "أ. لا خبرة",
      option2: "ب. خبرة محدودة",
      option3: "ج. خبرة متوسطة",
      option4: "د. خبرة متقدمة"
    },
    {
      question: "كيف تتعامل مع الضغوط النفسية والتقلبات الكبيرة في السوق؟",
      option1: "أ. بصعوبة",
      option2: "ب. بتوازن محدود",
      option3: "ج. بتوازن جيد",
      option4: "د. بإحترافية"
    },
    {
      question: "ما هي استراتيجيات التداول التي تعتمدها وتعلمها للمتداولين؟",
      option1: "أ. استراتيجيات قصيرة الأمد",
      option2: "ب. استراتيجيات طويلة الأمد",
      option3: "ج. استراتيجيات متوسطة الأمد",
      option4: "د. مجموعة من الاستراتيجيات المختلفة"
    },
    {
      question: "هل تستطيع تقديم أمثلة عن حالات عملية قمت فيها بمساعدة المتداولين على تحقيق أرباح ملموسة؟",
      option1: "أ. لا أمثلة",
      option2: "ب. أمثلة قليلة",
      option3: "ج. عدة أمثلة",
      option4: "د. أمثلة كثيرة وموثوقة"
    },
    {
      question: "كيف تبقى على اطلاع بآخر الأخبار والتطورات في السوق المالي؟",
      option1: "أ. لا أتابع الأخبار بانتظام",
      option2: "ب. أتابع الأخبار أحياناً",
      option3: "ج. أتابع الأخبار بانتظام",
      option4: "د. أتابع الأخبار بانتظام وأحللها"
    },
    {
      question: "ما هي الأساليب التي تتبعها لتقديم الدعم والمتابعة الشخصية للمتداولين؟",
      option1: "أ. تواصل عن طريق الواتساب فقط",
      option2: "ب. تواصل عن طريق الهاتف والرسائل",
      option3: "ج. تواصل شامل من خلال الهاتف والرسائل والاجتماعات",
      option4: "د. تواصل شامل ودوري ومتابعة مستمرة"
    }
  ];
  