export const questions = [
  {
    question: "عند التخطيط لرحلة أو حدث مهم، أنت تميل إلى: ",
    option1: "أ. التخطيط لكل التفاصيل بدقة.",
    option2: "ب. التخطيط للخطوط العريضة فقط وترك مساحة للمرونة.",
    option3: "ج. التخطيط بشكل عشوائي والاعتماد على الحدث نفسه.",
    option4: "د. عدم التخطيط مسبقًا وترك الأمور تجري كما هي.",
    option5: "هـ. تأجيل التخطيط قدر الإمكان."
  },
  {
    question: "عند مواجهة تغيير مفاجئ في الخطط، رد فعلك يكون:",
    option1: "أ. الشعور بالقلق والارتباك.",
    option2: "ب. التكيف بسرعة مع الوضع الجديد.",
    option3: "ج. مقاومة التغيير والتمسك بالخطة الأصلية.",
    option4: "د. رؤية التغيير كفرصة جديدة.",
    option5: "هـ. الشعور بالإحباط والتذمر."
  },
  {
    question: "عند التعرف على أشخاص جدد، أنت تميل إلى:",
    option1: "أ. الحذر والتردد في إقامة علاقات جديدة.",
    option2: "ب. الانفتاح على تجارب جديدة وتكوين صداقات بسهولة.",
    option3: "ج. الحفاظ على دائرة اجتماعية صغيرة ومقربة.",
    option4: "د. البحث عن تجارب اجتماعية مثيرة.",
    option5: "هـ. تفضيل العزلة والانطواء."
  },
  {
    question: "في المناقشات الحادة، أنت تميل إلى:",
    option1: "أ. الانسحاب من النقاش وتجنب الصراع.",
    option2: "ب. الدفاع عن رأيك بشدة والتفاوض بحزم.",
    option3: "ج. تجنب المواجهة والبحث عن حلول وسط.",
    option4: "د. الاستمتاع بالمناقشة والتعبير عن آرائك بحرية.",
    option5: "هـ. الشعور بالانزعاج وعدم الارتياح."
  },
  {
    question: "في العمل، أنت تفضل:",
    option1: "أ. المهام الروتينية والواضحة المعالم.",
    option2: "ب. المهام التي تتطلب الإبداع والتفكير خارج الصندوق.",
    option3: "ج. المهام التي تتطلب العمل ضمن فريق.",
    option4: "د. المهام التي تحمل مسؤولية كبيرة.",
    option5: "هـ. تجنب المسؤولية والعمل تحت إشراف الآخرين."
  },
  {
    question: "عند مواجهة موقف يتطلب اتخاذ قرار سريع، أنت تميل إلى:",
    option1: "أ. طلب المشورة من الآخرين قبل اتخاذ القرار.",
    option2: "ب. اتخاذ قرار سريع بناءً على الحدس.",
    option3: "ج. تأجيل القرار إلى وقت لاحق.",
    option4: "د. تحليل جميع الخيارات المتاحة بعناية قبل اتخاذ القرار.",
    option5: "هـ. الشعور بالضغط والتوتر."
  },
  {
    question: "في الاستثمارات المالية، أنت تفضل:",
    option1: "أ. الاستثمارات الآمنة ذات العائد الثابت.",
    option2: "ب. الاستثمار في مشاريع جديدة وواعدة.",
    option3: "ج. تنويع الاستثمارات بين الآمنة والمخاطرة.",
    option4: "د. الاستثمار في الأسواق المتقلبة بحثًا عن أرباح سريعة.",
    option5: "هـ. تجنب الاستثمار تمامًا خوفًا من الخسارة."
  },
  {
    question: "عند مواجهة تحدٍ جديد، أنت تشعر ب:",
    option1: "أ. القلق والتوتر.",
    option2: "ب. الحماس والتحدي.",
    option3: "ج. الحذر والتردد.",
    option4: "د. الرغبة في القيادة وتولي المسؤولية.",
    option5: "هـ. عدم الاهتمام وتفضيل الروتين."
  }
];
